app/Models/ResultsModel.php

    public function results($setWhere= false,$setOrder= false, $ids= false){
        $results= [];
        $q= $this->db->table("results");
        if($this->session->has("adminResultsWhere"))
            $where= $this->session->get("adminResultsWhere");
        if($setWhere)
            $where= $setWhere;
        if(!empty($where))
            $q= $q->where($where);
        if($ids)
            $q= $q->whereIn("id",$ids);
        if($setOrder)
            foreach ($setOrder as $field=>$direction)
                $q= $q->orderBy($field,$direction);
        else
            $q= $q->orderBy("sort","desc")->orderBy("id","desc");
        $q= $q->get();
---
SELECT *
FROM `results`
ORDER BY `sort` DESC, `id` DESC